# ==========================================
# تست Statistics Manager
# ==========================================


# مسیر فایل رویدادها
from config import DATABASE_FILE


# کلاس مدیریت آمار
from src.statistics_manager import (
    StatisticsManager
)


# ==========================================
# ساخت شیء آمار
# ==========================================

stats = StatisticsManager(
    DATABASE_FILE
)


# ==========================================
# نمایش تعداد کل رویدادها
# ==========================================

print(

    "Total Events:",

    stats.total_events()

)


# ==========================================
# نمایش تعداد رویدادهای امروز
# ==========================================

print(

    "Today Events:",

    stats.today_events()

)


# ==========================================
# نمایش تعداد رویدادهای هفته جاری
# ==========================================

print(

    "Week Events:",

    stats.week_events()

)


# ==========================================
# نمایش تعداد رویدادهای ماه جاری
# ==========================================

print(

    "Month Events:",

    stats.month_events()

)


# ==========================================
# نمایش آخرین رویداد ثبت شده
# ==========================================

print(

    "Last Event:",

    stats.last_event()

)