# ==========================================
# تست جستجو بر اساس تاریخ
# ==========================================


# مسیر دیتابیس
from config import DATABASE_FILE

# مدیریت دیتابیس
from src.database_manager import (
    DatabaseManager
)


# ==========================================
# ساخت شیء دیتابیس
# ==========================================

database = DatabaseManager(

    DATABASE_FILE

)


# ==========================================
# تاریخ مورد نظر
# ==========================================

target_date = "2026-07-14"


# ==========================================
# جستجوی رویدادها
# ==========================================

events = database.get_events_by_date(

    target_date

)


# ==========================================
# نمایش نتیجه
# ==========================================

print(

    "Events Found:",

    len(events)

)


for event in events:

    print(

        event

    )