# ==========================================
# تست جستجو بین دو تاریخ
# ==========================================


# مسیر دیتابیس
from config import DATABASE_FILE

# مدیریت دیتابیس
from src.database_manager import (
    DatabaseManager
)


# ==========================================
# ساخت شیء دیتابیس
# ==========================================

database = DatabaseManager(

    DATABASE_FILE

)


# ==========================================
# بازه زمانی
# ==========================================

start_date = "2026-07-01"

end_date = "2026-07-31"


# ==========================================
# جستجو
# ==========================================

events = database.get_events_between_dates(

    start_date,
    end_date

)


# ==========================================
# نمایش نتیجه
# ==========================================

print(

    "Events Found:",

    len(events)

)


for event in events:

    print(

        event

    )