# ==========================================
# تست جستجوی رویداد در دیتابیس
# ==========================================


# مسیر دیتابیس
from config import DATABASE_FILE

# مدیریت دیتابیس
from src.database_manager import (
    DatabaseManager
)


# ==========================================
# ساخت شیء دیتابیس
# ==========================================

database = DatabaseManager(

    DATABASE_FILE

)


# ==========================================
# جستجوی رویداد شماره 1
# ==========================================

event = database.get_event_by_id(

    1

)


# ==========================================
# نمایش نتیجه
# ==========================================

print(

    "Event 1:",

    event

)


# ==========================================
# نمایش تعداد کل رویدادها
# ==========================================

print(

    "Total Events:",

    database.count_events()

)