# ==========================================
# تست ثبت رویداد در دیتابیس
# ==========================================


# مسیر دیتابیس
from config import DATABASE_FILE


# مدیریت دیتابیس
from src.database_manager import (
    DatabaseManager
)


# ==========================================
# ساخت شیء دیتابیس
# ==========================================

database = DatabaseManager(

    DATABASE_FILE

)


# ==========================================
# ثبت یک رویداد آزمایشی
# ==========================================

database.insert_event(

    "screenshots/test.jpg",

    "recordings/test.avi"

)


# ==========================================
# نمایش همه رکوردها
# ==========================================

events = database.get_events()

print(

    events

)


# ==========================================
# نمایش تعداد رویدادها
# ==========================================

print(

    "Total Events:",

    database.count_events()

)


# ==========================================
# نمایش آخرین رویداد
# ==========================================

print(

    "Last Event:",

    database.get_last_event()

)